Autodesk.Revit.DB.Document.SaveCloudSharedModelCommon(System.Guid,System.String,System.String,System.Boolean)
Set of common processing for both previously workshared and not previously workshared central files.
projectId:
Uniquely identifies the C4R project to which this model will be attached.
modelName:
The name by which the model will be identified in Forge DM.
folderId:
The folder ID input from Forge DM
createLocal:
If true, this will create a local copy of the model.
Returns:
The guid that identifies the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
Could be for any of the reasons that SynchronizeWithCentral fails with CentralModelException, for example, a central model with that name
is already associated to the specified C4R project.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not authorized to access the specified C4R project.

Autodesk.Revit.DB.Document.SaveCloudSharedModelCommon(System.Guid,System.String,System.Boolean)
Set of common processing for both previously workshared and not previously workshared central files.
projectId:
Uniquely identifies the A360 project to which this model will be attached.
modelName:
The name by which the model will be identified in A360.
createLocal:
If true, this will create a local copy of the model.
Returns:
The guid that identifies the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
Could be for any of the reasons that SynchronizeWithCentral fails with CentralModelException, for example, a central model with that name
is already associated to the specified A360 project.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not authorized to access the specified A360 project.

Autodesk.Revit.DB.Document.SaveAsCloudModel(System.String,System.String,System.String)
Saves as a single user cloud model when current model is non-workshared model.
Saves as a multiple users cloud model (C4R) when current document is workshared model.
Remarks:
Assumes that user is currently signed in BMI360.
This operation will create a model on cloud and then create a local cache of the cloud model.
This method cannot be used when current document is already in cloud.
projectId:
Identifies the cloud project to which this model will be attached.
folderId:
The folder ID input from ForgeDM, model would be put under the root of project if it is set as empty.
modelName:
The cloud model name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
modelName is an empty string.
-or-
modelName cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelAlreadyExistsException:
Failed due to there is a model in cloud under the project with that name.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is a cloud model.
-or-
The document does not allow worksharing to be enabled.
-or-
Saving is not allowed in the current application mode.
-or-
This Document has is in an edit mode or is in family mode.
-or-
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
This Document is cloud model, cannot be saved as cloud model.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that saveAs fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud project.
Throws Autodesk::Revit::Exceptions::UnauthenticatedUserException:
User is not authenticated to access the specified cloud project.
Since:
2019